.planning/case_profiles/case_021_v65_tbl_2nd_re_dicts/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// Incompressible Newtonian air @ 15 °C · ρ=1.225 kg/m³ μ=1.79e-5 Pa·s
// ν = μ/ρ = 1.79e-5 / 1.225 = 1.4612e-5 m²/s
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel  Newtonian;

nu              1.4612e-05;

// ************************************************************************* //
