.planning/case_profiles/case_021_v65_tbl_2nd_re_dicts/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         5000;

deltaT          1;

writeControl    timeStep;
writeInterval   500;

purgeWrite      2;

writeFormat     ascii;
writePrecision  10;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    // Wall shear stress (Pa) for all wall patches — used for Cf extraction
    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    onEnd;
        writeFields     true;
        log             true;
        patches         (plate);
    }
    // y+ (dimensionless wall distance, first cell center)
    yPlus1
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        writeControl    onEnd;
        writeFields     true;
        log             true;
    }
    // Residual extraction for convergence verification (all 5 fields)
    residuals1
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (p U k omega);
        writeResidualFields false;
        writeControl    timeStep;
        writeInterval   1;
    }
}

// ************************************************************************* //
