.planning/case_profiles/case_021_v65_tbl_2nd_re_dicts/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// Single-core run (210k cells · steady RANS · ~5000 iter ETA single-core
// reasonable for substrate verification before parallelization decisions)
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 1;

method          scotch;

// ************************************************************************* //
